{
  "tokenToId": {
    "0": 12,
    "1": 8,
    "2": 6,
    "3": 19,
    "4": 14,
    "5": 11,
    "7": 22,
    "8": 35,
    "12": 18,
    "13": 15,
    "14": 7,
    "17": 46,
    "21": 48,
    "25": 55,
    "30": 23,
    "32": 29,
    "65": 32,
    "[UNK]": 0,
    "[START]": 1,
    "[END]": 2,
    "[PAD]": 3,
    "log4j": 4,
    "core": 5,
    "spring": 9,
    "boot": 10,
    "junit": 13,
    "jackson": 16,
    "databind": 17,
    "slf4j": 20,
    "api": 21,
    "commons": 24,
    "lang3": 25,
    "guava": 26,
    "jre": 27,
    "hibernate": 28,
    "netty": 30,
    "all": 31,
    "apache": 33,
    "io": 34,
    "org": 36,
    "logging": 37,
    "springframework": 38,
    "com": 39,
    "fasterxml": 40,
    "google": 41,
    "pkg": 42,
    "maven": 43,
    "npm": 44,
    "react": 45,
    "lodash": 47,
    "angular": 49,
    "express": 50,
    "axios": 51,
    "pypi": 52,
    "django": 53,
    "requests": 54,
    "numpy": 56,
    "pandas": 57,
    "flask": 58
  },
  "idToToken": {
    "0": "[UNK]",
    "1": "[START]",
    "2": "[END]",
    "3": "[PAD]",
    "4": "log4j",
    "5": "core",
    "6": "2",
    "7": "14",
    "8": "1",
    "9": "spring",
    "10": "boot",
    "11": "5",
    "12": "0",
    "13": "junit",
    "14": "4",
    "15": "13",
    "16": "jackson",
    "17": "databind",
    "18": "12",
    "19": "3",
    "20": "slf4j",
    "21": "api",
    "22": "7",
    "23": "30",
    "24": "commons",
    "25": "lang3",
    "26": "guava",
    "27": "jre",
    "28": "hibernate",
    "29": "32",
    "30": "netty",
    "31": "all",
    "32": "65",
    "33": "apache",
    "34": "io",
    "35": "8",
    "36": "org",
    "37": "logging",
    "38": "springframework",
    "39": "com",
    "40": "fasterxml",
    "41": "google",
    "42": "pkg",
    "43": "maven",
    "44": "npm",
    "45": "react",
    "46": "17",
    "47": "lodash",
    "48": "21",
    "49": "angular",
    "50": "express",
    "51": "axios",
    "52": "pypi",
    "53": "django",
    "54": "requests",
    "55": "25",
    "56": "numpy",
    "57": "pandas",
    "58": "flask"
  },
  "tokenFreq": {
    "0": 15,
    "1": 22,
    "2": 19,
    "3": 8,
    "4": 11,
    "5": 7,
    "7": 3,
    "8": 3,
    "12": 7,
    "13": 3,
    "14": 3,
    "17": 3,
    "21": 3,
    "25": 1,
    "30": 6,
    "32": 3,
    "65": 3,
    "[UNK]": 1,
    "[START]": 1,
    "[END]": 1,
    "[PAD]": 1,
    "log4j": 5,
    "core": 9,
    "spring": 3,
    "boot": 5,
    "junit": 5,
    "jackson": 5,
    "databind": 3,
    "slf4j": 5,
    "api": 3,
    "commons": 10,
    "lang3": 3,
    "guava": 5,
    "jre": 3,
    "hibernate": 5,
    "netty": 5,
    "all": 3,
    "apache": 5,
    "io": 7,
    "org": 10,
    "logging": 2,
    "springframework": 2,
    "com": 4,
    "fasterxml": 2,
    "google": 2,
    "pkg": 20,
    "maven": 10,
    "npm": 5,
    "react": 1,
    "lodash": 1,
    "angular": 1,
    "express": 1,
    "axios": 1,
    "pypi": 5,
    "django": 1,
    "requests": 1,
    "numpy": 1,
    "pandas": 1,
    "flask": 1
  },
  "nextId": 59
}